# Создать информационную систему позволяющую работать с учениками школы
# функции
# Добавление нового студента
# (Поля - имя, фамилия, название предмета, оценка)
# Добавление предмета
# Добавление оценки ученику по предмету
# Показ списка учеников
# Показ листа оценок конкретного ученика
# Выход из программы

# Доп*:
# 1) Добавить функцию генерации сразу ста учеников и записи их в журнал
# (имя - рандомное из списка нескольких имен
# фамилия - рандомная из списка нескольких фамилий
# название предмета - рандом из списка с предметами
# оценка - рандом от 1 до 5)
# 2) Вывод средней оценки ученика по одному предмету +
# 3) Вывод среднего балла по школе по конкретному предмету
# 4)Вывод количества учеников претендующих на золотую медаль (все оценки либо 4 либо 5)
# Добавить хранение в файле, и импорт из файла


import controller as c

c.button_click()